In [9]:
import pandas as pd
import numpy as np

In [10]:
movie_data = "IMDB movies.csv"

movie_df = pd.read_csv(movie_data)
movie_df['country'] = movie_df['country'].str.split(',').str[0]

C:\Users\leann\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3146: DtypeWarning: Columns (18) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [11]:
country_df = movie_df[["country"]]
country_df = country_df.dropna(how='any')

In [12]:
country_df

         country
0        Hungary
1            USA
2      Argentina
3             UK
4          China
...          ...
85848      Japan
85849      Japan
85850      Japan
85851      Japan
85852      India

[85789 rows x 1 columns]

In [13]:
count_country = pd.DataFrame(country_df[["country"]].value_counts())
count_country.sort_values(0, ascending=False)

               0
country
USA        30908
India       6189
UK          5889
France      5202
Italy       3785
...          ...
Gibraltar      1
Bermuda        1
Brunei         1
Andorra        1
Libya          1

[161 rows x 1 columns]

In [15]:
count_country.to_csv("movies per country.csv", encoding="utf-8", index=True, header=True)